ltsochev-dev/esp32-weather-station/lib/OpenWeather/OpenWeather.cpp
// Client library for the OpenWeather data-point server
// https://openweathermap.org/

// Created by Bodmer 09/04/2020
// Updated by Bodmer 08/01/2021

// See license.txt in root folder of library
// Insecure mode added by ADAMSIN12

#ifdef ESP8266
  #include <ESP8266WiFi.h>
#else
  #include <WiFi.h>
#endif

#include <WiFiClientSecure.h>

// The streaming parser to use is not the Arduino IDE library manager default,
// but this one which is slightly different and renamed to avoid conflicts:
// https://github.com/Bodmer/JSON_Decoder

#include <JSON_Listener.h>
#include <JSON_Decoder.h>

#include "OpenWeather.h"


/***************************************************************************************
** Function name:           getForecast
** Description:             Setup the weather forecast request
***************************************************************************************/
// The structures etc are created by the sketch and passed to this function.
// Pass a nullptr for current, hourly or daily pointers to exclude in response.
// ESP8266: Setting secure to false will invoke an insecure connection with AXTLS
//          for the connection, when set true BearSSL will be used.
// ESP32:   Secure parameter has no affect.
bool OW_Weather::getForecast(OW_current *current, OW_hourly *hourly, OW_daily *daily,
                             String api_key, String latitude, String longitude,
                             String units, String language, bool secure) {

  data_set = "";
  hourly_index = 0;
  daily_index = 0;
  Secure = secure;

  // Local copies of structure pointers, the structures are filled during parsing
  this->current  = current;
  this->hourly   = hourly;
  this->daily    = daily;

  // Exclude some info by passing fn a NULL pointer to reduce memory needed
  String exclude = ",alerts";
  if (!current)  exclude += ",current";
  if (!hourly)   exclude += ",hourly";
  if (!daily)    exclude += ",daily";

  String url = "https://api.openweathermap.org/data/2.5/onecall?lat=" + latitude + "&lon=" + longitude + "&exclude=minutely" + exclude + "&units=" + units + "&lang=" + language + "&appid=" + api_key;

  // Send GET request and feed the parser
  bool result = parseRequest(url);

  // Null out pointers to prevent crashes
  this->current  = nullptr;
  this->hourly   = nullptr;
  this->daily    = nullptr;

  return result;
}

/***************************************************************************************
** Function name:           partialDataSet
** Description:             Set requested data set to partial (true) or full (false)
***************************************************************************************/
void OW_Weather::partialDataSet(bool partialSet) {
  
  this->partialSet = partialSet;
}

#ifdef ESP32 // Decide if ESP32 or ESP8266 parseRequest available

/***************************************************************************************
** Function name:           parseRequest (for ESP32)
** Description:             Fetches the JSON message and feeds to the parser
***************************************************************************************/
bool OW_Weather::parseRequest(String url) {

  uint32_t dt = millis();

  OW_STATUS_PRINTF("\n\nThe connection to server is secure (https). Certificate not checked.\n");
  WiFiClientSecure client;
  client.setInsecure(); // Certificate not checked

  const char*  host = "api.openweathermap.org";
  port = 443;

  if (!client.connect(host, port))
  {
    OW_STATUS_PRINTF("Connection failed.\n");
    return false;
  }

  JSON_Decoder parser;
  parser.setListener(this);

  uint32_t timeout = millis();
  char c = 0;
  parseOK = false;

#ifdef SHOW_JSON
  int ccount = 0;
#endif
  // Send GET request
  OW_STATUS_PRINT("Sending GET request to "); OW_STATUS_PRINT(host); OW_STATUS_PRINT(" port "); OW_STATUS_PRINT(port); OW_STATUS_PRINTF("\n");
  client.print(String("GET ") + url + " HTTP/1.1\r\n" + "Host: " + host + "\r\n" + "Connection: close\r\n\r\n");

  // Pull out any header, X-Forecast-API-Calls: reports current daily API call count
  while (client.connected())
  {
    String line = client.readStringUntil('\n');
    if (line == "\r") {
      OW_STATUS_PRINTF("Header end found\n");
      break;
    }

#ifdef SHOW_HEADER
    Serial.println(line);
#endif

    if ((millis() - timeout) > 5000UL)
    {
      OW_STATUS_PRINTF ("HTTP header timeout\n");
      client.stop();
      return false;
    }
  }

  OW_STATUS_PRINTF("\nParsing JSON\n");

  // Parse the JSON data, available() includes yields
  while ( client.available() > 0 || client.connected())
  {
    while(client.available() > 0)
    {
      c = client.read();
      parser.parse(c);
#ifdef SHOW_JSON
      if (c == '{' || c == '[' || c == '}' || c == ']') Serial.println();
      Serial.print(c); if (ccount++ > 100 && c == ',') {ccount = 0; Serial.println();}
#endif
    }

    if ((millis() - timeout) > 8000UL)
    {
      OW_STATUS_PRINTF("Client timeout during JSON parse\n");
      parser.reset();
      client.stop();
      return false;
    }
    yield();
  }

  OW_STATUS_PRINTF("\nDone in "); OW_STATUS_PRINT(millis()-dt); OW_STATUS_PRINTF(" ms\n");

  parser.reset();

  client.stop();
  
  // A message has been parsed, but the data-point correctness is unknown
  return parseOK;
}

#else // ESP8266 version

/***************************************************************************************
** Function name:           parseRequest (for ESP8266)
** Description:             Fetches the JSON message and feeds to the parser
***************************************************************************************/
bool OW_Weather::parseRequest(String url) {
  if (Secure) return parseRequestSecure(&url);
  else return parseRequestInsecure(&url);
}

bool OW_Weather::parseRequestSecure(String* url) {

  uint32_t dt = millis();

  const char*  host = "api.openweathermap.org";

  // Must use namespace:: to select BearSSL
  BearSSL::WiFiClientSecure client;
  client.setInsecure(); // Certificate not chhecked
  port = 443;

  if (!client.connect(host, port))
  {
    OW_STATUS_PRINTF("Connection failed.\n");
    return false;
  }
  JSON_Decoder parser;
  parser.setListener(this);

  uint32_t timeout = millis();
  char c = 0;
  parseOK = false;

  #ifdef SHOW_JSON
  int ccount = 0;
  #endif

  OW_STATUS_PRINTF("\nThe connection to server is using BearSSL in insecure mode (certificates not checked).\n");

  // Send GET request
  OW_STATUS_PRINTF("Sending GET request to api.openweathermap.org...\n");
  client.print(String("GET ") + *url + " HTTP/1.1\r\n" + "Host: " + host + "\r\n" + "Connection: close\r\n\r\n");

  // Pull out any header, X-Forecast-API-Calls: reports current daily API call count
  while (client.available() || client.connected())
  {
    String line = client.readStringUntil('\n');
    if (line == "\r") {
      OW_STATUS_PRINTF("Header end found\n");
      break;
    }

    OW_STATUS_PRINT(line); OW_STATUS_PRINTF("\n");

    if ((millis() - timeout) > 5000UL)
    {
      OW_STATUS_PRINTF ("HTTP header timeout\n");
      client.stop();
      return false;
    }
  }


  // Parse the JSON data, available() includes yields
  while (client.available() || client.connected())
  {
    while (client.available())
    {
      c = client.read();
      parser.parse(c);
  #ifdef SHOW_JSON
      if (c == '{' || c == '[' || c == '}' || c == ']') Serial.println();
      Serial.print(c); if (ccount++ > 100 && c == ',') {ccount = 0; Serial.println();}
  #endif
    }

    if ((millis() - timeout) > 8000UL)
    {
      OW_STATUS_PRINTF ("JSON client timeout\n");
      parser.reset();
      client.stop();
      return false;
    }
  }

  OW_STATUS_PRINTF("\nDone in "); OW_STATUS_PRINT(millis()-dt); OW_STATUS_PRINTF(" ms\n");

